# Тексты кнопок
MENU_GET_CODE_BUTTON_TEXT = "Мой код"
MENU_PROFILE_BUTTON_TEXT = "ЛК"
MENU_SCHEDULE_BUTTON_TEXT = "Расписание"
MENU_STORE_BUTTON_TEXT = "Магазин"
MENU_PROMO_BUTTON_TEXT = "Ввести промокод"
MENU_HELP_BUTTON_TEXT = "Помощь по боту и неделе"

# Тексты сообщений
MENU_TEXT = "Добро пожаловать в моё меню, нажимайте на кнопочки снизу. 😎"

GENERATE_CODE_TEMPLATE = "Ваш код 🔢\n\n<b>{}</b>"
PROFILE_TEMPLATE = "{} 👤\n\nБаланс: {}i\n\nМногочленство в профкоме: {}"
PROFILE_ERROR = "Извините, произошла ошибка. Вас нет в базе данных."

TUC_TEXTS = {
    0: "не в профкоме",
    1: "в профкоме",
    2: "на проверке"
}
