# Тексты сообщений

HOW_CREATE_PROMO_TEXT = "Введи, как ты хочешь, чтобы промокод выглядел, или напиши \"случайно\", " \
                        "чтобы сгенерировать автоматически. \n\n" \
                        "Ты можешь в любой момент написать \"отмена\", чтобы вернуться в меню"
PROMO_ALREADY_EXISTS_TEXT = "Такой промокод уже существует. \n" \
                            "Пожалуйста, введи другой или напиши \"случайно\""
NUM_POINTS_PROMO_TEXT = "На какую сумму промокод?"
NUM_POINTS_ERROR_PROMO_TEXT = "Пожалуйста, введи целое положительное число"
NUM_USES_PROMO_TEXT = "Введи количество использований или напиши \"не ограничено\""
NUM_USES_ERROR_PROMO_TEXT = "Пожалуйста, введи целое положительное число или напиши \"не ограничено\""
PERIOD_PROMO_TEXT = "Введи срок действия промокода в часах (например: 3ч) или в днях (например: 1д)"
PERIOD_ERROR_PROMO_TEXT = "Пожалуйста, введи срок действия в формате \"(целое число >0)ч\" или \"(целое число >0)д\""

PROMO_ADDED_TEMPLATE = "Создан промокод {} на сумму {}i\n\n"
PROMO_ADDED_INFO_TEMPLATE = "Действителен в течение {}\n" \
                            "Число применений: {}"
PROMO_TO_LIST_TEMPLATE = "Промокод {} на сумму {}i. "
PROMO_TO_LIST_INFO_TEMPLATE = "Срок действия: до {}, число применений: {}"
INFINITE_USES_TEXT1 = "неограниченное число"
INFINITE_USES_TEXT = "не ограничено"
