# Тексты сообщений
NO_EVENT_ERROR_TEXT = "За тобой не закреплено мероприятие"

SCAN_CODE_TEMPLATE = "Текущее мероприятие: {}. Введи код участника или напиши \"отмена\", чтобы вернуться в меню"
SCAN_CODE_TEXT = "Введи код участника или напиши \"отмена\", чтобы вернуться в меню"

NO_PARTICIPANT_TEXT = "Такого участника нет в базе, он не зарегистрирован:("
MONEY_GIVEN_ALREADY_TEMPLATE = "Участнику {} уже начислены баллы"
GIVE_MONEY_TEMPLATE = "Участник: {}. Начислить {}i?"
MONEY_GIVEN_TEMPLATE = "Начислено {}i участнику {}"
NOT_MONEY_GIVEN_TEMPLATE = "Участнику {} код не просканирован"

# Тексты кнопок
YES_BUTTON_TEXT = "Да"
NO_BUTTON_TEXT = "Нет"
