# Тексты кнопок
MENU_SCANER_BUTTON_TEXT = "Сканер кодов"
MENU_MERCH_BUTTON_TEXT = "Выдача мерча"
MENU_CREATE_PROMO_BUTTON_TEXT = "Создать промокод"
MENU_LIST_PROMO_BUTTON_TEXT = "Список промокодов"
MENU_GIVE_ACCESS_BUTTON_TEXT = "Выдать доступ"
MENU_ADMINS_LIST_BUTTON_TEXT = "Список админов"
MENU_TAKE_AWAY_ACCESS_BUTTON_TEXT = "Забрать доступ силы персила"
BACK_TO_MENU_BUTTON_TEXT = "Отмена"

# Тексты сообщений
ORG_MENU_TEXT = "Показываю меню организатора \n" \
                "Вы самые лучшие, вы со всем справитесь..."
BACK_TO_MENU_TEXT = "Возвращаю в мейн меню \n" \
                    "Смотри, клавиатура появилась"
TAKE_OUT_ACCESS_USERNAME_INPUT_TEXT = "Пожалуйста, введите username человека, у которого вы ходите забрать силу"
TAKE_OUT_ACCESS_DONE_TEMPLATE = "Вы успешно забрали силу персила у <u>{}</u> (@{})"
TAKE_OUT_ACCESS_NOT_FOUND_TEXT = "Этого человека нет в админах 😥"
