GREETING_FIRST_MESSAGE_TEXT = "Привет, ну как там твоя учёба?"
GREETING_SECOND_MESSAGE_TEXT = "Скажи, пожалуйста, как тебя зовут," \
                      " чтобы ты мог получить <b><i>заслуженный мерч</i></b> по окончании этой жаркой недельки."
GREETING_THIRD_MESSAGE_TEXT = "Кстати, цены в магазине напрямую зависят от того, состоишь ли ты в Профкоме," \
                     " поэтому ошибаться при вводе не в твоих интересах."
GREETING_FOURTH_MESSAGE_TEXT = "Ну всё, жду ФИО, сладенький. 😏"

NICE_TO_MEET_TEMPLATE = "Приятно познакомиться, {}."
NOT_IN_TUC_TEXT = "Насколько я понимаю, ты не состоишь в Профкоме?  😥"


